In [116]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import math

In [132]:
df = pd.read_csv('datatest2.csv',index_col=0)

weighted rating (WR) = (v ÷ (v+m)) × R + (m ÷ (v+m)) × C

In [133]:
df = df.iloc[0:,0:3]
df

                        Store                        User  Rating
0     NAP's Coffee & Roasters                   Nuunet D.     5.0
1     NAP's Coffee & Roasters                   vanai sun     3.0
2     NAP's Coffee & Roasters              Phonanan Seeon     5.0
3     NAP's Coffee & Roasters  Chavakorn Laophetsakunchai     5.0
4     NAP's Coffee & Roasters               community man     5.0
...                       ...                         ...     ...
3348             Yuanjai Cafe          อาจณรงค์ กลมเกลียว     5.0
3349             Yuanjai Cafe                          ??     5.0
3350             Yuanjai Cafe              ประจงจิต จันทป     5.0
3351             Yuanjai Cafe          Chatthawat Warnjai     5.0
3352             Yuanjai Cafe                 TAE.SIRIWAT     5.0

[3327 rows x 3 columns]

In [71]:
av = df.groupby('Store')['Rating'].mean().reset_index(name="mean") ## C

In [72]:
C = df.groupby(["Store"])["User"].count().reset_index(name="count") ## quantile

In [73]:
df2= C.merge(av,on='Store')

In [74]:
df2.head()

                      Store  count      mean
0  11.11 Gallery and Coffee     26  4.653846
1      Abe Specialty Coffee     14  4.785714
2                    Amarna     45  4.733333
3             Anna Roasters    233  4.592275
4                 Attaroast     37  4.837838

In [75]:
C = df2['mean'].mean()
C

4.560949853648421

In [103]:
m = df2['count'].quantile(0.6)
m

86.6

In [104]:
listA = df2.copy().loc[df2['count'] >= m]
listA.shape

(14, 3)

weighted rating (WR) = (v ÷ (v+m)) × R + (m ÷ (v+m)) × C

In [105]:
def weighted_rating(x, m=m, C=C):
    v = x['count']
    R = x['mean']
    return (v/(v+m) * R) + (m/(m+v) * C)

In [106]:
listA['score'] = listA.apply(weighted_rating, axis=1)

In [110]:
listA = listA.sort_values('score', ascending=False)

#Print the top 15 movies
listA[['Store', 'count', 'mean', 'score']].head(20)

                      Store  count      mean     score
11         GODFATHER COFFEE    132  4.704545  4.647659
27            Snoopcat Cafe     96  4.687500  4.627482
17  NAP's Coffee & Roasters    178  4.646067  4.618210
25               Saereesook    100  4.630000  4.597954
3             Anna Roasters    233  4.592275  4.583787
14            LIFE Roasters    255  4.556863  4.557899
6        BalconyKiss Coffee    133  4.518797  4.535420
18              Nap x Warin     87  4.505747  4.533285
22              ROOF COFFEE    135  4.451852  4.494487
16               My Papilio    264  4.382576  4.426635
9                Bossa cafe    132  4.310606  4.409782
8              Blues Coffee    113  4.238938  4.378649
20           Phantae Coffee    205  4.248780  4.341489
30       Tree Cafe Rim Moon    402  4.238806  4.295903

In [143]:
df

                        Store                        User  Rating
0     NAP's Coffee & Roasters                   Nuunet D.     5.0
1     NAP's Coffee & Roasters                   vanai sun     3.0
2     NAP's Coffee & Roasters              Phonanan Seeon     5.0
3     NAP's Coffee & Roasters  Chavakorn Laophetsakunchai     5.0
4     NAP's Coffee & Roasters               community man     5.0
...                       ...                         ...     ...
3348             Yuanjai Cafe          อาจณรงค์ กลมเกลียว     5.0
3349             Yuanjai Cafe                          ??     5.0
3350             Yuanjai Cafe              ประจงจิต จันทป     5.0
3351             Yuanjai Cafe          Chatthawat Warnjai     5.0
3352             Yuanjai Cafe                 TAE.SIRIWAT     5.0

[3327 rows x 3 columns]

In [159]:
df.groupby(['Store','Rating']).Rating.count().to_frame('count').reset_index()

                        Store  Rating  count
0    11.11 Gallery and Coffee     3.0      1
1    11.11 Gallery and Coffee     4.0      7
2    11.11 Gallery and Coffee     5.0     18
3        Abe Specialty Coffee     4.0      3
4        Abe Specialty Coffee     5.0     11
..                        ...     ...    ...
122                 r o u n d     4.0      3
123                 r o u n d     5.0      6
124                    sangob     3.0      3
125                    sangob     4.0     13
126                    sangob     5.0     41

[127 rows x 3 columns]

https://stackoverflow.com/questions/1411199/what-is-a-better-way-to-sort-by-a-5-star-rating

In [160]:
def starsort(ns):
    """
    http://www.evanmiller.org/ranking-items-with-star-ratings.html
    """
    N = sum(ns)
    K = len(ns)
    s = list(range(K,0,-1))
    print(s)
    s2 = [sk**2 for sk in s]
    z = 1.65
    def f(s, ns):
        N = sum(ns)
        K = len(ns)
        return sum(sk*(nk+1) for sk, nk in zip(s,ns)) / (N+K)
    fsns = f(s, ns)
    return fsns - z*math.sqrt((f(s2, ns)- fsns**2)/(N+K+1))

In [161]:
x = (18, 7, 1, 0, 0)
starsort(x)

[5, 4, 3, 2, 1]

4.1032604607846155

In [162]:
count

0       1
1       7
2      18
3       3
4      11
       ..
122     3
123     6
124     3
125    13
126    41
Name: count, Length: 127, dtype: int64